# GetId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinitionAccessor..::..GetId Method
FailureDefinitionAccessor Class See Also
---
Retrieves the unique identifier of the FailureDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureDefinitionId GetId()
```

Visual Basic
---
```text
Public Function GetId As FailureDefinitionId
```

Visual C++
---
```text
public:
FailureDefinitionId^ GetId()
```

# ### Return Value
The unique identifier of the FailureDefinition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The FailureDefinitionAccessor has not been properly initialized. |

# See Also
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace